# 3

for i in range(50,200):
    print(i)

# 4

for i in range(0,101,2):
    print(i)

# 5

for i in range(101,150,2):
    print(i)

# 6

num = 1
while num < 50:
    print(num)
    num += 1

# 7

num = 20
while num < 60:
    print(num)
    num += 5

# 8

last_name = input('enter your last name :')
for i in last_name:
    print(i)

# 9

juice = 300
while juice > 0:
    print(f'you have bought the drink')
    juice -= 2
    print(f'{juice} juices are left.')
    if juice == 0:
        print('out of stock')

# 10

for i in range(50,20,-3):
    print(i)

# 11

for i in range(150,0,-1):
    print(i)

# 12

# for loop - მუშაობს ასე; მისი წერის წესის მიხედვით ჯერ უნდა დავწეროთ for, შემდეგ ცვლადის სახელი (ძირითადად გამოიყენება i), შემდეგ in range, ვხსინთ ფრჩხილებს და შგნით ვწერთ ჯერ რიცხვს საიდანაც უნდა დაიწყოს ათვლა, შემდეგ სად უნდა გაჩერდეს და როგორი ნაბიჯებით დაითვალოს, შემდეგ ვუწწერთ ორ წერტილს. ქვემოთა ხაზზე კედლიდან დაშორებით ვწერთ print და ფრჩხილებში ცვლადის სახელს. ამის შემდეგ ტერმინალში გამოვა რიცხვები.

# 13

# while loop - მუშაობს ასე; პირველ რიგში უნდა მივუთითოთ ცვლადი რომელსაც while loop-ში counter-ს ვუწოდებთ, შემდეგ while loop-ის წერის წესის მიხედვით უნდა დავწეროთ while, (ცვლადის სახელი), (შედარების ოპერატორი), (რაიმე რიცხვი); შემდეგ კედლიდან დაშორებით ვწერთ print(ცვლადის სახელი), ქვემოთა ხაზზე კვლავ კედლიდან დაშორებით ვწერთ ცვლადის სახელს და ყოველ ჯერზე ცვლადში მოქცეულ რიცხვს დააკლდეს თუ მოემატოს რაიმე რიცხვი. შემდეგ კი გამოგვაქ ტერმინალში.